"""
Выведите на экран список всех файлов из текущего каталога
"""
import os

print(os.listdir())

"""
Выведите на экран список всех файлов из родительского каталога.
"""

print(os.listdir())